Tested #386: (Is it better to write my results here or at the PR)?

I added a wrong memory value (e.g. "1") such that I produced an API error:

```
vcd_vapp_vm.instance: Still creating... [1m30s elapsed]

Error: task did not complete successfully:  [400:BAD_REQUEST] - [ e981be7a-b463-47d3-a5aa-6fb0e7ca493f ] The virtual machine memory size must be a multiple of 4 MB.

  on main.tf line 45, in resource "vcd_vapp_vm" "instance":
  45: resource "vcd_vapp_vm" "instance" {
```

I changed the memory to "1024" and rerun the terraform apply.
I found multiple issues:
a) It wants to rebuild the VM? Is this really needed. I expected an in place update of the VM?
b) metadata and guest_properties should not be marked as removed. Same or "known after apply"
c) ip and mac in network block shloud not change.

```
> terraform apply
vcd_vapp.vapp: Refreshing state... [id=urn:vcloud:vapp:decb29d1-3463-47b3-a6e6-a304652b41a1]
vcd_vapp_vm.instance: Refreshing state... [id=urn:vcloud:vm:ebbb7549-20af-4a31-b94a-3d682d347510]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # vcd_vapp_vm.instance is tainted, so must be replaced
-/+ resource "vcd_vapp_vm" "instance" {
        accept_all_eulas               = true
        catalog_name                   = "asys-linux"
        computer_name                  = "buec011-test1"
        cpu_cores                      = 1
        cpus                           = 1
      + description                    = (known after apply)
        expose_hardware_virtualization = false
      - guest_properties               = {} -> null
      ~ href                           = "https://access.devcloud.arvato-systems.de/api/vApp/vm-ebbb7549-20af-4a31-b94a-3d682d347510" -> (known after apply)
      ~ id                             = "urn:vcloud:vm:ebbb7549-20af-4a31-b94a-3d682d347510" -> (known after apply)
      + ip                             = (known after apply)
      + mac                            = (known after apply)
      ~ memory                         = 2048 -> 1024
      - metadata                       = {} -> null
        name                           = "buec011-test1"
        power_on                       = true
      ~ storage_profile                = "Intermediate" -> (known after apply)
        template_name                  = "asys_centos_7_latest"
        vapp_name                      = "buec011-test1"

      ~ network {
          ~ ip                 = "10.65.67.100" -> (known after apply)
            ip_allocation_mode = "POOL"
            is_primary         = true
          ~ mac                = "00:50:56:0b:01:41" -> (known after apply)
            name               = "test-network-01"
            type               = "org"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

HCL used:

```
variable "hostname" {
  description = "Hostname for the instance"
  default     = "please_fill_me"
}

variable "cpu" {
  description = "Number of CPUs for the instance"
  default     = "please_fill_me"
}

variable "core" {
  description = "Number of cores per CPU for the instance"
  default     = "please_fill_me"
}

variable "memory" {
  description = "Amount of memory for the instance"
  default     = "please_fill_me"
}

variable "network" {
  description = "Name of the network for the instance"
  default     = "please_fill_me"
}

variable "private_ip" {
  description = "Private IP for the instance. If nothing set take automatically generated IP."
  default     = null
}

variable "image_catalog" {
  description = "Name of the catalog of the image/template"
  default     = "please_fill_me"
}

variable "image_string" {
  description = "Name of the image/template"
  default     = "please_fill_me"
}

resource "vcd_vapp" "vapp" {
  name = var.hostname
}

resource "vcd_vapp_vm" "instance" {
  name          = var.hostname
  computer_name = var.hostname
  vapp_name     = vcd_vapp.vapp.name
  catalog_name  = var.image_catalog
  template_name = var.image_string
  cpus          = var.cpu
  cpu_cores     = var.core
  memory        = var.memory

  network {
    type               = "org"
    name               = var.network
    ip_allocation_mode = var.private_ip == null ? "POOL" : "MANUAL"
    ip                 = var.private_ip
    is_primary         = true
  }
}

output "instance_id" {
  value = vcd_vapp_vm.instance.id
}

output "no_nat_private_ip" {
  value = vcd_vapp_vm.instance.network[0].ip
}
```